{
  "preRequisites:11": [
    117
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "There are three types of distortion value, which can be obtained by different ways, here is a brief explanation... \n\nThere are three types of distortion values: \n§5 Temporary Distortions§r\nTemporary Distortions can be gained by consuming Zombie Brains, conducting Evil Science research at the Research Table, using Evil Treasures and Bloody Treasures, being seen by Evil Wardens and Evil Warden's Death Stare, and failing to stay away from the Rift when it collapses. \n A distortion that will definitely be reduced when the distortion kicks in, and a distortion that will be removed anyway after the use of Exorcism Soap. \n\n§5 Twist/Sticky Twist§r\n Normal Twist is a general, regular twist that can be gained by performing Evil Science research at the Research Table, using Evil Treasures, crafting Brain in a Vat, and by not staying away when a Rift Collapses. \n has a chance of being reduced when the distortion strikes, and the use of Exorcism Soap has a chance of reducing the distortion by no more than 2 points only under harsh conditions. \n\n§5 Permanent Distortion §r\nPermanent Distortion is an indelible, soul-straightening distortion which cannot be removed. \nBut the source of this distortion is also simple, unlocking Forbidden Knowledge (the study surrounded by purple smoke in the Magic Manual) to obtain it. \nAnyway, this distortion value is not reduced, and there's only one way to reduce your permanent distortion in this integration pack, but that's all in the later stages of the game. \n\n§5 Equipment Distortion§r\nTheoretically, equipment distortion is one of those permanent distortions that can be artificially increased or decreased; it is gained when you hold or equip armor, and disappears again when you switch off the item or take off the armor.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 5,
        "OreDict:8": "",
        "id:8": "thaumcraft:curio"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Types of distortion",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}
