{
  "preRequisites:11": [
    256
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "As you play, the words \"§5 Your body is distorted§r\" appear in front of your screen with an eerie sound. This means that the distortion value in your \"mind\" has increased. \\n\\nTwisting is not a good thing, it will occasionally apply some strange debuffs to you, disrupting your gameplay and affecting your concentration, in the following, the player affected by twisting the event is called \"Twisted Episode\". \\n\\nTwisted Episodes have different effects depending on the value of your Twist (Temporary+Normal+Permanent), and they're mostly bad, but some good effects are not excluded: \\nTip \"What's with the cacophony of voices? Something is trailing you ......\"\\n A spellflow effect that lasts 250 seconds, increases by 1 level (up to 3) for every 15 points of distortion, and prompts \"An odd feeling of fatigue wells up in you.\" \\n\\n One-time: unlocks purifying bath salts and prompts \"There must be some way to curb these headaches!\" \\n Increases the level 1 metaphysical hysteria effect by 0.5 seconds per 1 point of distortion value, and prompts \"Your stomach suddenly makes an unusually odd gurgling sound.\" \\n Lasting 250 seconds, increases the level 1 (up to 3) of the Perverse Hunger effect by 1 per 15 points of Twisted Value, and prompts \"A sudden perverse hunger is straining you.\" \\n\\nPrompts \"Something is trailing you ......\"\\n\\nGenerates 1 Evil Guard and prompts \"A thick fog grows out of thin air, with ghostly shadows in its path.\" \\n\\n Every 1 point of distortion value increases the effect of high myopia by 0.5 seconds of vision dimming \\n Lasting 250 seconds, every 15 points of distortion value increases the effect of Day's Insult by 1 level (maximum 3 levels) and prompts, \"The light suddenly becomes bright and irresistible, and your skin begins to burn.\" \\n Lasts 60 seconds, increasing the Digging Fatigue effect by 1 level (up to 3) for every 15 distortion points and prompting \"Suddenly, you tire of destruction.\" \\n Lasts 300 seconds, increases the spellflow effect by 1 level (up to 3) per 15 points of distortion value, and prompts \"An odd sense of fatigue wells up in you.\" \\n\\n Increases the night vision effect by 2 seconds for every 1 point of distortion value, and prompts \"Your senses expand violently.\" \\n Lasting 300 seconds, the Death Gaze effect increases by 1 level (up to 3) for every 15 points of Distortion value, and prompts \"Your vision suddenly becomes eerily blurry.\" \\n\\n Generates 1 non-damaging Mind Spider per 1 point of Distortion and prompts \"They're everywhere! Run!\" \\n\\nPrompts \"A gaze from the underworld is watching you, perhaps it's time to strike.\" \\n\\nGenerates 1 Evil Guard for every 30 points of Twist and prompts \"A thick fog grows out of thin air, with ghostly shadows in its path.\" \\n\\n Low Probability: reduces normal distortion by 1 point, and prompts \"For a moment, you feel an overwhelming clarity of mind.\" \\n Lasting 300 seconds, the perverse hunger effect increases by 1 level (up to 3) for every 15 points of distortion, and prompts \"A sudden perverse hunger strains you.\" \\n\\nGenerates 1 small bloody portal and prompts \"The faint sound of that chant is faintly audible nearby.\" \\n\\nGenerates 1 damage-only Mind Spider for every 1 point of distortion, and prompts \"They're everywhere! Run!\" \\n\\nGenerates 1 Evil Guard for every 15 points of distortion and prompts \"A thick fog grows out of thin air, with ghostly shadows in its midst.\" \\n\\nThere are three types of distortion values: \\n§5 Temporary Distortions§r\\nTemporary Distortions can be gained by consuming Zombie Brains, conducting Evil Science research at the Research Table, using Evil Treasures and Bloody Treasures, and being seen by Evil Wardens and Evil Warden's Death Gazes. \\n A distortion that will definitely be reduced when the distortion kicks in, and a distortion that will be removed anyway after the use of Exorcism Soap. \\n\\n§5 Twist/Sticky Twist§r\\n Normal Twist is a general, regular twist, which can be gained by consuming Zombie Brains, performing Evil Science Research at the Research Table, using Evil Treasures, and unlocking Evil Research. \\nThere is a chance to reduce the distortion by no more than 2 points when the distortion kicks in, using Exorcism Soap has a chance to reduce the distortion by no more than 2 points only under harsh conditions. \\n\\n§5 Permanent Distortion §r\\nPermanent Distortion is an indelible, soul-straightening distortion which cannot be removed. \\nBut the source of this distortion is also very simple,unlocking Forbidden Knowledge (research surrounded by purple smoke in the Magic Manual) to obtain it. \\nAnyway, this distortion value is not reduced, and there is only one way to reduce your permanent distortion in this integration pack, but that's all in the big later stages. \\n\\n§5 Equipment Distortion§r\\nTheoretically, equipment distortion is one of those permanent distortions that can be artificially increased or decreased; it is gained when you hold or equip armor, and disappears again when you switch off that item or take off your armor.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 5,
        "OreDict:8": "",
        "id:8": "thaumcraft:curio"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Twisted. Twisted effects.",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}
