{
  "preRequisites:11": [
    60
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "The conditions for the creation of rifts have already been mentioned above, now let's talk about some of the effects of rifts on the environment. \\n\\nFirst of all, rifts are biased towards appearing on the highest squares in the block they are located in, so if you don't have enough power to control your pollution, you can put a wall on the block your base is located in to prevent rifts from devouring containers that have items stored in them. \\n\\nSecondly, Rift has a stabilization value, usually, Rift will absorb spell waves in the aura field to maintain its own stability, when the spell waves contain very little/zero, Rift will be unstable, unstable Rift may impose a \"Spell Streaming\" Debuff for the surrounding players, creating spell streaming clouds in the player's location and further increasing the instability of the Rift, when the spell waves contain very little/zero, Rift will become unstable. When the instability of the rift reaches a certain level, the rift will disappear. \\n\\nThe disappearance of a rift usually occurs in two ways, collapse and decay. \\n\\nCollapse has a very low probability of occurring naturally, collapsing away a fissure will drop rewards such as Void Seeds and Beginning Pearls for unlocking Evil Artistry after collapsing, and collapsing is bound to happen to a fissure that has been blown up by a §cParadoxical Substance§r. \\n\\nCorruption for most cases, the rift will suddenly disappear and leave behind a Corruption Spore Nest, which is similar to TC4's Corruption Node and is the source of Corruption, it will slowly pollute the surrounding environment and apply a §5Corruption Poison§rDebuff on the surrounding creatures, the life value of the creatures infected with Corruption Poison will return to zero and they may change to the corresponding \"Corruption\" species, their blood level will increase. \"Corrupted\" species, with increased blood count and aggressiveness towards the player. \\n\\nSo, when the Corruption Spore Nest appears near the base, it must be killed as soon as possible. In the early stages, melee combat is often undesirable, and can be killed with long-range weapons such as mage gauntlets or bone bows, and Corruption Spore Nests will drop Corruption Pieces and (with a small probability) Twisted Rarities after they are defeated.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumcraft:bottle_taint"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "fracture",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}
