{
  "preRequisites:11": [
    75
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "Spellwaves in the aura field are difficult to remove using conventional methods, and you have to wait until the spellwave spreads to other zones or is absorbed by the rift, which of course are passive spellwave cleanups. \n\nIn the early stages, you can use the spell wave condenser to clear the spell waves, install the partition grill on the condenser and pass non-corrosive source material around the condenser, place a jar for holding contaminated source material under the condenser, and the spell wave condenser will work properly. \n\nThe more Condensation Spacers you use, the more efficiently the original site is used, meaning that a bit of non-corrupted source matter cleans up more spellwaves. \n\nHowever, the Condensation Barrier has a chance of clogging (turning purple) when absorbing spellwaves, and you need to right-click on it with a Source Matter Filter Tube to fix it; this operation consumes Source Matter Filter Tubes, so increase your Source Matter Filter Tube reserves. \n\nWarning: do not pass contaminated source mass into the spellwave condenser, or your condenser-connected spacer grill will instantly change to a clogged state.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumcraft:condenser"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Spellwave Cleanup",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}
