{
  "preRequisites:11": [
    78
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "In the last chapter we talked about the generation of corruption, so here we are going to explain the spread of corruption. \n\n Spellwave creates a Corruption Spore Hive after a Corruption Fission, but a Corruption Spore Hive is ultimately limited in its ability to spread, and can't sustain Corruption over too great a distance for long. At this point, the decay spores will appear at the edge of what the nest can control, and they will also spread decay and will produce decay spores at the edge of their range, a vicious cycle! \n\nAnd, if the decay is too severe, then new Corruption Spores may be generated after you kill the Corruption Spore nest and the Corruption Spores! That's why you have to travel for a long time to clean up the decay, otherwise, the decay may still come back. \n\nIf the decay spreads too deep, resulting in decay spores appearing in underground caves, because the decay cubes are very difficult to excavate, and in the early stages there is no good means of excavating the decay cubes (the decay cubes are extremely resistant to explosions), so it will produce a situation where you can't clean up the decay completely! In the early stages, if you can't control the formation of decay, please make sure to keep it away from the base, otherwise it will be too late to do anything about it!",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumcraft:taint_geyser"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Proliferation of Corruption",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}
