{
  "preRequisites:11": [
    56
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "1. Why doesn't the enchantment altar stabilize/rune matrix turn? \\After completing the structure of the Magic Altar with World Salt, you need to activate the Rune Matrix with a right-click of the Mage's Hand in order for the magic to work properly. \\n\\n2.How does my core hit itself/why can't the core be decorated? \\n Runes are the \"core\" part of the core, the necessary components of the spell, there are three kinds: \\n Effect: determines what effect the spell can ultimately produce, damage or healing, destruction or construction (although there is no construction of this effect). \\nMedium:Determines the medium/trajectory/manner in which the spell takes effect. The rune shape is hexagonal. \\nAdjustment: Adjustments to the first two runes, currently there are only three, \\nThrough the combination of the three can produce either practical or interesting spells, the next will be introduced in turn to the specific effects of each rune, \\n\\n\\n\\n3. How do I know what kind of items have elements in them/how do I synthesize elements? \\Please use JEI,R/Left to view the synthesis table,U/Right to view the items that can be synthesized. The first stage of the elements can only be decomposed by the source centrifuge, but to synthesize the elements, you need the source synthesizer made from the \"secret silver\" material in the later stages of the mystical realm. \\n\\4. Why is there a long black thing in my house, and how do I get rid of it? \\nSpellwave Rifts are created in the vicinity of the current area when spellwave contamination is too high, destroying squares it touches and damaging creatures that come into contact with it. \\The fissure will slowly increase in size over time and eventually disappear naturally. There is a high probability that the fissure will create a nest of corrupted spores that will spread corruption, so you need to kill it in time in order to stop the source of the corruption. \\nTo manually eliminate the corrupted fissure, you need to unlock the paradoxical substance in the basic science, which is preceded by the study of the aura battery (and then preceded by the crystallization farm, which is scanning for clusters of wild magic crystals). \\nBe careful: when Paradox Matter blows up the cracks, you need to stay away from it before it completely disappears, otherwise it will increase a lot of distortion value and debuffs.\\n\\n5.How to clear the spell wave? \\n(1)Mystic original spell wave condenser \\n(2)Mystic realm of pure flowers (single effect is not obvious, need to mass production)\\n(3)Mirrorology spell wave purifier, burn the world salt to consume aura to clear the spell wave at a very fast speed, the ratio of 1.5:1.\\nNote: This method is fast but the cure is not the root cause of the problem. \\n(4). Mysterious wonderland spell wave container, is a more stable late clear spell wave square, individual efficiency is slightly lower but extremely stable.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "minecraft:fish"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Frequently Asked Questions for Newcomers",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}
