{
  "preRequisites:11": [
    624
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "Meta-dynamic energy is hard to collect, but most of the time, some devices can run for a long time with a very little bit of meta-dynamic energy, but not the Arcane Cluster Converter, it needs to consume huge amount of meta-dynamic energy and other energies, so using a rift to slowly extract it is always not a solution, we need to store meta-dynamic energy. \n\nBuilding a metamotion matrix is not laborious, just follow the instructions in the book, but the next steps are more tedious. \n\nFirst, the meta-dynamic energy units need to be right-clicked and loaded on the four sides of the base below the top of the matrix, so a maximum of eight can be installed. The matrix will be activated even if there is only one unit. An increased number of units will allow the MetaDynamic Matrix to cache more MetaDynamic Energy and speed up deposits and withdrawals. To remove a meta-dynamic energy unit, simply right-click empty-handed. However, by doing so, the excess energy will disappear, so be careful not to waste it. The \n\n matrix has to be maintained stable, and as the energized meta-dynamic energy is stored in the structure, the structure begins to gradually destabilize. As more and more meta-dynamic energy is stored, the loss of stability becomes greater and greater. The meta-motion matrix can be detected by symmetrically placing the Stability Cubes, which are smaller than the Altar of Magic, only 5 x 5 will suffice, but the stability is calculated in the same way as for the Altar of Magic. Once the Meta-Dynamic Matrix becomes unstable, it may release some lavender lightning arcs, or pop Meta-Dynamic Energy Units out of their pedestals, or have other detrimental effects. You can learn about the stability gains and losses of the matrix by observing the matrix square in the center while wearing the Goggles of Revelation. The \n\n metamotion matrix has one input slot and one output slot. When using the Metamotion Resonator Binding, you need to point it toward the center matrix square binding. The color of the matrix runes can also predict how much energy is in the matrix: red means no energy, yellow means half full, and green would mean it's full. Alternatively a redstone comparator can be placed next to any part of the metamotion matrix to output a redstone signal representing the amount of energy stored inside.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumicaugmentation:impetus_matrix"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Storing meta-dynamic energy -- meta-dynamic matrix",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:pedestal_eldritch"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:infusion_matrix"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:salis_mundus"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 3,
          "OreDict:8": "",
          "id:8": "thaumicaugmentation:material"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "2:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 2,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 12,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:candle_white"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "3:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 3,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 4,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:stabilizer"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
