{
  "preRequisites:11": [
    626,
    635
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "The Arcane Swarm System Converter is an advanced device that requires the use of 3 energy sources, Yuan Dynamics, Aura, and Source Mass, to work. \n\nThe specific operation is as follows:\n\nThe first step is to configure the biota of the surrounding blocks with the Arcane Group System Converter. By using an empty Swarm Core in the current biome, you can gather basic information about the current biome. By holding a swarm core and sneaking right-clicking on it you can clear the current swarm information, making it reusable. If you want to change the swarm system back to its original swarm system, i.e. the original state. Simply create an original swarm core: place an empty swarm core and a genesis pearl on the workbench to synthesize it in an unordered manner. This operation does not consume the Meta Beginning Pearl. \n\nThe second step is to place it in the world and right-click to open the GUI to start debugging its interface. Place the configured swarm system core in the center of the operation interface. After loading the Cluster Core, you can see that on the right side of the operation panel is the Mechanical Range of Action setting, which allows you to change the size and shape of the specified Cluster; while the left side of the operation panel displays the amount of source mass needed to transform the entire area. \n\nThe third step, please make sure that the Group System Transformer has enough Aura, Source Mass, and Yuan Dynamic Energy. Aura can be drawn from within the zone, please equip the Aura Regenerator to generate a constant supply of Aura for the device to use. This device has only one metamagic energy input slot and no metamagic energy output slot. An arcane group system converter may require the following five source elements: Ignis, Aqua, Terra, Aer, and Permutatio. the first four are the basic elements necessary to make up a group system of organisms. For example, a hot system needs Ignis, a humid system needs Aqua, and so on. Some biomes may not need some of the basic elements at all. But every biome system needs Permutatio elements. As the range to be transformed increases, so do the resources needed. Once \n\n preparation is complete, right-click on the Arcane Cluster System Converter with the Mage's Handguard in hand to begin the conversion process. If you want to cancel the conversion, you can tap with the gauntlet again, but the converted position will not be restored as a result. The \n\n Arcane Cluster Converter can reshape the aura field in any area. When converting a group system with a low aura threshold to one with a high magical affinity (such as an enchanted forest), the block's aura threshold is raised. But a Converter can also lower the Aura Threshold in the same way. \n\n§c Note: This device will fail in the Endlands!",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumicaugmentation:arcane_terraformer"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "arcane group transmuter",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "ForgeCaps:10": {
            "Parent:10": {
              "biome:8": "thaumicaugmentation:biome_empty"
            }
          },
          "OreDict:8": "",
          "id:8": "thaumicaugmentation:biome_selector"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
