{
  "preRequisites:11": [
    37
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "Choosing different cards will have different effects, the following are the different effects: \\n\\n Card Effects (Consuming Inspiration): \\n\\n Experimentation (1) - Gain 15~30% Completion in one random subject, and 1~10% Completion in Fundamentals. \\n\\nAnalysis* (2) - Exchange 1 Observational Research point for 25~50% completion in that subject, another subject gains 5% completion. \\n\\n Abandon (0) - Keeps the existing completion in a subject and does not draw any cards about that subject, and gains 5% completion in Basic Studies. \\n\\nReflection (-1) - Loses a total of 10% completion in all subjects equally, Basic Studies gains 1 to 10% completion, and the player gains 1 Inspiration and an additional card draw. \\n\\nContemplation* (2) - All subjects lose an average of 25% completion, Basic Studies gain 5% completion, and the player gains an additional card draw. \\n\\nNote (1) - Lose all completion in one subject and transfer 50-100% of the lost completion to another subject. \\n\\nInspiration (2) - The subject with the highest current completion gains 10% + current completion/2 completion. \\n\\nResearch (1) - A subject receives 15-25% completion. \\n\\nUniversal Theory (1) - Distributes all existing completions evenly across all subjects, with Foundation Studies gaining 5% completion and one additional subject receiving the full amount of completion. \\n\\nResearch Treasures (1)- Consume 1 treasure, Basic Studies and one random subject gain 5% completion, the corresponding subject of the treasure gains 25~35% completion (if the treasure is a Blood Ritual, Cultic Studies gains 15~20%, and Occult Studies gains 10~15%). \\n\\nResearch Enchantment (1) - Consumes 5 levels of experience and gains 15~20 completion points each in Arcane Infusion and Occultism. \\n\\nAura Role (-2) - The player gains 2 Inspiration as well as an extra chance to draw a card, an extra subject will gain full completion. \\n\\nThe Study of Celestial Signs (1) - By consuming two Celestial Notes, the subject with the highest level of current completion will gain 25~50% completion, and different types of notes will have different special effects. \\n\\n [Day: one additional subject will gain full completion. Month: Gain an extra chance to draw cards. Star: Gain 0~10% completion in Evil Science, as well as up to 5 points of Temporary Twist.] \\n\\n Concentration (1) - Gain 15% Alchemy Completion and one additional card draw, 33% chance of gaining 1 Inspiration. \\n\\nReaction (1) - Gain 25% Alchemy Completion and a 33% chance to gain 1 Inspiration. \\n\\nSynthesis (1) - Synthesize two fragments into the one corresponding to the combination element, gaining 40% Alchemy Completion and a 33% chance to gain 1 Inspiration. \\n\\nMeasurement (1) - Gain 15% Arcane Infusion Completion and an additional card draw. \\n\\nInfusion Experiment (1) - Consume Item X and Source Mass Ampoule to gain 10+1.5*√(Item X Total Source Mass Content)% Arcane Infusion Completion. \\n\\n Guidance (1) - Gain 25% Arcane Infusion completion. \\n\\nCalibration (1) - Gain 15% Alchemy Completion and an additional card draw. \\n\\nAdjustment (1) - Gain 3*√(total source quality content of item) ~ 3*√(total source quality content of item) + 10 % Alchemical Completion. \\n\\nConsciousness Transcends Matter (1) - Consume item X and gain 10 + √ (total source quality content of item X) % alchemical completion. \\n\\nBinding Spells (1) - Lose up to 5 levels of experience and gain 5% Occult Completion for each level lost. \\n\\nCognizance (1) - Gain 20% Occult Completion, 33% chance of gaining 1~5% Cultic Completion and 1 point of Normal Twist. \\n\\nTotal Concentration (1) - Gain 15% Occultism completion and an additional card draw. \\n\\nSculpture (1) - Consume 1 Clay Orb to gain 20% Golemology completion and one additional card draw. \\n\\nScripting (1) - Consume 1 sheet of paper and 1 point of ink to gain 25% Puppetry completion. \\n\\nSynergy (1) - Lose a total of 15% completion in Alchemy, Alchemy and Arcane Infusion on average and gain 30% completion in Puppetry. One additional subject will gain the full amount of completion. \\n\\nDark Whispers (1) - Consume all of the player's experience levels to gain 0.2*level~0.5*level % completion in Evil Science, the player gains √(level) points of Normal Twisting, a 50% chance of √(level) % completion in Random Subjects, and a 50% chance of an additional card draw. \\n\\nResearch Sculpture (1) - Gain 10 to 20% Evil Science Completion, 10 to 20% Random Subject Completion, and the player gains 5 points of Temporary Distortion. \\n\\nEpiphany (1) - Gain 15% Evil Science completion, 5~10% completion in each of the two random subjects, the player gains 5 points of Temporary Twist, 50% chance the player gains 1 point of Normal Twist. \\n\\nRevelation (1) - Gain 30% Evil Science completion and 5~10% completion in a random subject, player gains 5 points of Temporary Distortion and 1 point of Normal Distortion. \\n\\nSeeking Truth (1) - Gain 10~25% Evil Science Completion and an additional card draw, the player gains 3 points of Temporary Distortion. \\n\\nOtherworldly Echoes (-1) - Gain 5~10% completion in Evilology and two random subjects each, gain 1 Inspiration and 2 additional card draws, and the player gains 5 points of Temporary Distortion and 1 point of Normal Distortion. \\n\\nGain Inspiration (-1) - \\n10 to 35 points of branching progress on the first choice, one point of inspiration and one additional branching choice, consumes 5 points of source mass from memory. \\n\\nGain Insanity (-1) - Gain a certain number of Evilology branching points (increasing with the number of choices), add one point of inspiration and one additional branching choice, consume memory 10 source quality points. \\n\\nRestoration Matter/Energy (1) - Gain 10~25% branching progress in Energetics. \\n\\nRift in the Vat (1) - Three random branches gain 10~30% branching progress. Two additional subjects gain full completion. \\n\\n Fissure Monitor (1) - Cultivation gains 20~40% branching progress without distortion. \\n\\n§l§6§lSource: mcmod.cn,Author Harmless Cookies.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumcraft:scribing_tools"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Research",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {
    "0:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:paper"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 1,
          "OreDict:8": "",
          "id:8": "thaumcraft:curio"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:dye"
        }
      },
      "index:3": 0,
      "rewardID:8": "bq_standard:choice"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}
