{
  "preRequisites:11": [
    88
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "Put the pen and ink on the wooden table (you don't need two in a row, just one) to create a research table, the research table is the main way for players to get theories (those research in the gold box). \\How to use it: \\n\\\\nThe first time you use it, you need a pen and ink, put the materials in the upper left corner of the interface, you also need some paper, put it in the upper right corner of the interface, and then tap \"Create Theory\" in the center of the interface to start researching. \\After you start, tap the \"?\" button on the left side of the screen. Start drawing cards (each draw costs one paper), two cards will be randomly generated (three cards will be generated if there is an extra chance to draw cards), tap on the card to select the card. \\n\\nThe light on the top side of the card is the amount of inspiration that will be reduced by choosing that card, and cards with a plus sign in front of the light will increase inspiration. \\n\\nThe lower side of the card is the required item, which needs to be placed in the backpack (§c§l or adjacent container §r¹) to be selected, items with exclamation marks will be consumed when you select the card, and each time you complete a confirmation it will consume the durability of the pen and ink. \\n\\\\nWhen you have consumed all of your Inspiration click on Complete Theory to gain Theory Research Progress, you will lose some of the Theory Research Progress gained in all but the highest progressing disciplines, and you can boost the number of disciplines that are fully rewarded with certain cards. \\n\\nThe initial number of inspirations will increase as you unlock the number of \"※\" shaped research unlocks. \\n\\n (Usage from https://www.mcmod.cn/item/77166.html) \\n\\n§l1: ThaumTweaks used!",
      "frame:8": "GATE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumcraft:research_table"
      },
      "ignoresview:1": 0,
      "ismain:1": 1,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "抽抽抽卡",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 32,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:paper"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:scribing_tools"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:table_wood"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
