{
  "preRequisites:11": [
    27,
    54
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "Once you've got the Magic Guidebook, the next step is to craft the Arcane Workbench and the Magic Lens. \\nFirst, you'll have to open the Magic Guide Manual and click on the initial fumbling research in the blinking to unlock the recipe for crafting the Arcane Workbench. \\nThen, you'll want to right-click on the workbench using the World Salt, and the workbench will turn into an Arcane Workbench, which can be used to craft Mystic Age base items. \\nThere are 6 empty spaces next to the 3x3 GUI, each of which can be used to put in the corresponding color of Magic Crystal Shards. Synthesizing will consume the number of crystal shards shown in the recipe sheet. \\nAnd the small blue letters above the finished product column indicate the amount of aura in the zone where the Arcane Workbench is located. \\nAfter placing an item, if the synthesis is satisfied, the product will be displayed. \\nWherein, if a spinning circle of light appears, it represents the consumption of the magic crystal shards of the corresponding element. \\nA light blue number in Vis appears above the small blue letters representing the total amount of Aura, this number indicates the amount of area Aura consumed by this synthesis. \\nOne significant advantage of the Arcane Workbench is that items placed in it do not return to the item bar by exiting the interface. \\nAfter that, open the Magic Manual again and click on \"Finish Research\" to complete the current research (on the Arcane Workbench) and unlock the research for the new research (on the Magic Lens). \\Then, use the 6-color Magic Crystal, 4 Gold Ingots and 1 Glass Plate to synthesize the Magic Lens on the Arcane Workbench. \\nAfter synthesizing the Magic Guide Lens, sweep sweep sweep, right click or sneak right click to scan all squares. \\nWhile holding the Magic Guide Lens, all unscanned squares will be marked with flashing light blue highlights. \\nYou can also hover the Magic Guide Lens over the item to be scanned and it will scan automatically. \\n Scanning will unlock some research and gain knowledge of Observation. \\nThe more complex the square being scanned, the more knowledge is gained. \\nSome research unlocks require scanning the corresponding item or getting the corresponding knowledge.",
      "frame:8": "GATE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumcraft:thaumometer"
      },
      "ignoresview:1": 0,
      "ismain:1": 1,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Basic Preparation",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:arcane_workbench"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:thaumometer"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
