{
  "preRequisites:11": [
    88,
    200
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "We begin by crafting the Crucible to unlock Alchemy. \\nFirst, before we can use the Crucible, we need to introduce the concept of the aura field. \\nTC6's concept of auras differs from TC4's nodes. \\nTC6's auras naturally fill the blocks, and your arcane activity is no longer limited by nodes. The unit of Aura is Vis, and its minimum precision is 0.1. \\n Aura is commonly used in spell casting and synthesis, and various arcane recipes will consume Aura to synthesize, while Aura will be slowly restored under normal circumstances. \\n Aura is not like the staff Vis in TC4, regardless of elemental type, which makes it easier to build magic crystal farms. Each block has a separate and different aura threshold. Auras above the Aura Threshold can spread into surrounding blocks at a very slow rate. \\nThe Aura Threshold is the maximum amount of Aura that can be recovered naturally within a block. \\nEvery block has a corresponding Aura Threshold, and it cannot be changed. When in the Enchanted Forest Biome System, the Aura Threshold is greater, which means that the aura in the area is more abundant and the recovery rate is faster. \\n holding a magic lens, you will see the aura status of the zone among the aura bars on the top left of the interface. When sneaking, you will be able to see the exact aura value. \\nSpell waves are generated when the remaining source matter in the crucible is not disposed of in time or when the crucible is emptied directly without treatment. \\A spell wave can be thought of as a \"contaminated aura\". \\It affects the recovery of Aura in a block, and in severe cases, it will create a rift, which will destroy surrounding blocks (including chests, ME drives, etc.) and consume the fallen items. \\nWhen a spell wave is generated, you can clearly observe a dark purple plum-shaped cloud of spell waves towards the sky. \\nWhile no effect occurs from direct contact with these spellwave clouds, generating a spellwave cloud is equivalent to a certain amount of spellwaves having been discharged into the aura field of the zone. \\nAnd the spell wave can also spread slowly to the surrounding blocks, the speed of spreading is higher than the speed of aura spreading. \\n The maximum spell wave value of the block is 32766. \\nWith a magic lens in hand, you will see the number of spell waves in this block in the aura bar at the top left of the interface, which appears as a dark purple spell wave bar over a light pink aura bar. \\nAbout Rift:Spell Wave Rift can be generated when the value of Spell Wave in the block is greater than 75% of the Aura Threshold, and for every additional 50 Spell Waves, the chance of generating Spell Wave Rift in the block will increase by 1%. When a spellwave rift extends into a block, it destroys the block. Creatures near a spell rift take 2 points of ongoing void damage. There are many ways to destroy Spellwave Rift, but none of them are currently achievable by you, so in the early stages, you have to wait for Spellwave Rift to disappear naturally after absorbing all the spell waves. The natural disappearance of the rift often means the creation of the Corruption Spore, which is the source of contamination, extremely difficult to kill and spreads spreading corruption, so don't let it show up in your base! \\nYou can use quartz shards to dispose of excess source matter in your crucible, so that means you need to have enough quartz, the small amount of quartz in the main world is only enough to help you make a little bit of quartz shards, so to make more, head to the lower world. \\n\\nGo to the relevant section for a more detailed description.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 1,
        "OreDict:8": "",
        "id:8": "thaumicaugmentation:rift_seed",
        "tag:10": {
          "flux:3": 1000,
          "grown:1": 1
        }
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Aura and Mantra Wave",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 64,
          "Damage:2": 9,
          "OreDict:8": "",
          "id:8": "thaumcraft:nugget"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 128,
          "Damage:2": 9,
          "OreDict:8": "",
          "id:8": "thaumcraft:nugget"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
