{
  "preRequisites:11": [
    88,
    96
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "You've understood the concept of Spellwave, now you can come to use the Crucible! \\nFirst, click on the blinking research to unlock and view the recipe. \\nSecond, make the Crucible according to the recipe in the Magic Manual, which is the original Alchemy Pot right-clicked with World Salt. \\nHeat the crucible using a heat source (flame, magma (block), Shining Light, etc.) and then, use the bucket to add water to the crucible.Note that you can't use the bucket to hold the water that's in the crucible, which means that if you want to drain the crucible ahead of time, you can only do so by draining the water out of the crucible via Shift+Right click. \\n Secondly, to craft items, you need to unlock the corresponding research with enough elements. \\nHolding shift and moving the mouse towards the item, you can see the elements contained in the item, if it doesn't show up it proves that the item doesn't contain elements. \\nThen, items containing elements that are thrown into the crucible will be dissolved by the crucible and dispersed into the elements they contain. \\nWhen there are enough elements, and you have unlocked the corresponding research, throw the item to be processed into the water filled with boiled water. You will be able to make the corresponding item directly. \\nBe aware that the source material in the crucible will decompose and disappear over time, producing purple smoke. This is exactly the spell wave described in the previous chapter. Each point of element corresponds to one point of spell wave value. Sneaking right-click then empties the elements in the crucible at once, and the effect is the same as digging up the crucible directly or decomposing it naturally, both of which will generate spell waves. Therefore, you need to dispose of crucibles with excess elements with Quartz Shards in a timely manner.",
      "frame:8": "GATE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "thaumcraft:crucible"
      },
      "ignoresview:1": 0,
      "ismain:1": 1,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Alchemy 2",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:crucible"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": "",
          "id:8": "thaumcraft:ingot"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:ingot"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
