{
  "preRequisites:11": [
    601,
    603
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "The Heart of Mystical Biology is an advanced head part when crafting a golem. \\A golem equipped with this part will have the \"Intelligence\" attribute, which allows the golem to perform advanced tasks such as harvesting crops and slaughtering animals. \\nBut at the same time, you will also get the \"Fragile\" attribute, which reduces the armor value of the golem. \\To counteract this, you need to unlock the \"War Machine\" research, which will allow you to craft \"Armored Smart Heads\" in the Golem Workshop. \\You can make the \"Armored Wisdom Head\" at the Puppet Workshop. Only puppets with the \"Wisdom\" attribute can complete the task of this mark. \\n\\nVarious high-level seals: Compared to the lower-level variants, the high-level seals have more configurable items and black/white list restrictions, and can only be used by puppets with the \"intelligence\" attribute. \\n\\nHarvest Mark: This mark searches for ripe crops within its range and instructs the golem to harvest them, allowing the golem that picks up the item to replant the crop when there are both \"gathering\" marks in effect. \\Slaughter Seal: When there are more than 2 of a certain animal in range, this seal will request a nearby eligible golem to kill the excess adult animals. \\n\\n Slash Mark: This mark requests nearby puppets with the [Dig] and [Wisdom] attributes to dig up logs in the range. This mark has a \"running\" effect, so even if the entire tree is out of range, the golem can cut down the entire tree as long as the roots are in range. \\n§cNote: The Golem may get stuck in a log and suffocate, so be careful when using this mark! §r",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 1,
        "OreDict:8": "",
        "id:8": "thaumcraft:mind"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Premium Seal",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {
    "0:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 10,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:brain"
        },
        "1:10": {
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "thaumcraft:mind"
        }
      },
      "index:3": 1,
      "rewardID:8": "bq_standard:choice"
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 1,
          "OreDict:8": "",
          "id:8": "thaumcraft:mind"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "entryLogic:8": "AND",
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 4,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 7,
          "OreDict:8": "",
          "id:8": "thaumcraft:seal"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
